In [3]:
import pandas as pd

In [4]:
python_people = {
 'first_name': ['Mateen', 'Kaisar', 'Sidrat'],
 'last_name': ['Alam', 'Hameed', 'khan'],
 'age':[21,21,21]
}

In [5]:
python_people['last_name']

['Alam', 'Hameed', 'khan']

In [6]:
ourdf = pd.DataFrame(python_people)

In [7]:
ourdf[['last_name', 'age']] # specify a list

  last_name  age
0      Alam   21
1    Hameed   21
2      khan   21

In [8]:
ourdf

  first_name last_name  age
0     Mateen      Alam   21
1     Kaisar    Hameed   21
2     Sidrat      khan   21

In [11]:
# Indexers

In [ ]:
# you can index a row or a column using three different methord
[1,5,8]

In [9]:
#          rows, cols
ourdf.iloc[1:3, 1:2]  # second row second column

  last_name
1    Hameed
2      khan

In [24]:
ourdf.iloc[[1,2]] #  loop friendly indexer

  first_name last_name  age
1     Kaisar    Hameed   21
2     Sidrat      khan   21

In [10]:
ourdf.loc[0:1, ['first_name','age']] # user friend

  first_name  age
0     Mateen   21
1     Kaisar   21

In [ ]:
df['']
df.iloc[  ,  ] # pandas dataframe always maintain interger 
df.loc[  ]

In [29]:
ourdf

  first_name last_name  age
0     Mateen      Alam   21
1     Kaisar    Hameed   21
2     Sidrat      khan   21

In [ ]:
# inplace --->>> whether or not a dataframe was mutated

In [ ]:
ourdf.set_index('first_name', inplace=True)

In [34]:
ourdf

           last_name  age
first_name
Mateen          Alam   21
Kaisar        Hameed   21
Sidrat          khan   21

In [42]:
ourdf.loc[['Mateen','Kaisar'], ['age','last_name']]   # do you understand this?

            age last_name
first_name
Mateen       21      Alam
Kaisar       21    Hameed

In [43]:
ourdf.iloc[0]

last_name    Alam
age            21
Name: Mateen, dtype: object